espressif/esp-adf/adf_examples/ai_agent/baidu_rtc/solutions/voice_assistant_app/sdkconfig.defaults.esp32s3
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0009

#
# SDK tool configuration
#
CONFIG_SDK_TOOLPREFIX="xtensa-esp32s3-elf-"
# CONFIG_SDK_TOOLCHAIN_SUPPORTS_TIME_WIDE_64_BITS is not set
# end of SDK tool configuration

#
# SPI RAM config
#
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y

CONFIG_SPI_FLASH_HPM_DC_ON=y
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y

#
# Audio HAL
#
CONFIG_ESP32_S3_KORVO2_V3_BOARD=y
